Revit 2026 API

# SeparatorItem Properties

---

The SeparatorItem type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from MenuItem) |

#### Reference

SeparatorItem Class

Autodesk.Revit.UI Namespace